{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 100, 100, 3], "filters": 8, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "filters": 12, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "filters": 16, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "units": 128, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "units": 1, "name": "dense_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "sigmoid", "kernel_constraint": null, "trainable": true}}]}}