{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"name": "conv2d_1", "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "filters": 8, "dtype": "float32", "bias_regularizer": null, "batch_input_shape": [null, 100, 100, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "filters": 12, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "filters": 16, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "units": 128, "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "units": 1, "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}